# Dropping entries from an axis

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [5]:
obj = Series(np.arange(5),index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [18]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [19]:
obj.drop(['a','d'])

b    1
c    2
e    4
dtype: int32

In [20]:
data = DataFrame(np.arange(16).reshape(4,4),columns=['one','two','three','four'],index=['Hyderabad','karachi','lahor','islambad'])
data

           one  two  three  four
Hyderabad    0    1      2     3
karachi      4    5      6     7
lahor        8    9     10    11
islambad    12   13     14    15

In [21]:
data.drop(['Hyderabad','lahor'])

          one  two  three  four
karachi     4    5      6     7
islambad   12   13     14    15

In [22]:
data.drop('two',axis=1)

           one  three  four
Hyderabad    0      2     3
karachi      4      6     7
lahor        8     10    11
islambad    12     14    15

In [23]:
data.drop(['two','four'],axis=1)

           one  three
Hyderabad    0      2
karachi      4      6
lahor        8     10
islambad    12     14

In [17]:
obj[[1,3]]

b    1
d    3
dtype: int32